K6/testdata/register/ER-data/testcase-set-konk/set-konk.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.altinn.no/services/Register/ER/2013/06">
    <soapenv:Header/>
    <soapenv:Body>
        <ns:SubmitERDataBasic>
        <ns:systemUserName>${soapErUsername}</ns:systemUserName>
        <ns:systemPassword>${soapErPassword}</ns:systemPassword>
            <ns:ERData><![CDATA[<?xml version="1.0" encoding="UTF-8"?>
        <batchAjourholdXML>
            <head avsender="ER" dato="20260512" kjoerenr="00313" mottaker="ALT" type="A" />
            <enhet organisasjonsnummer="748525247" organisasjonsform="AS" hovedsakstype="E" undersakstype="EBTC" foersteOverfoering="N" datoFoedt="20200101" datoSistEndret="20260512">
                <status stattype="KONK" endringstype="N">
                    <dato>20260512</dato>
                </status>
            </enhet>
            <trai antallEnheter="1" avsender="ER" />
        </batchAjourholdXML>]]></ns:ERData>
        </ns:SubmitERDataBasic>
    </soapenv:Body>
</soapenv:Envelope>
